#+title:Constraining networks of biophysically-based neuron models using genetic algorithms
#+AUTHOR: Michael A Eager
#+DATE:
#+LANGUAGE:  en_GB
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t 
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+TODO: REFTEX
#+LATEX_CLASS: UoM-draft-org-article
#+BIBLIOGRAPHY: MyBib plainnat



\setcounter{chapter}{4}
\chapter[GAChapter]{Simultaneous Optimisation of Microcircuits using Genetic Algorithms}\label{sec:GAChapter}
\vspace{5cm}{\centering\today\, version :\input{.hg/tags.cache}}
# \begin{synopsis}
# {GA optimsation of the \CN stellate network}
# \end{synopsis}


* Prelude                                                          :noexport:

#+begin_src emacs-lisp
(setq TeX-master t)
  ;; (setq org-latex-to-pdf-process '("pdflatex -interaction nonstopmode %f" 
  ;;                                  "makeglossaries %b" "bibtex %b" "pdflatex -interaction nonstopmode %f" 
  ;;                                  "pdflatex -interaction nonstopmode %f" )) 
  ;; (setq org-latex-to-pdf-process '("lapdf Chapter3")) 
  (setq org-latex-to-pdf-process '("pdflatex -interaction nonstopmode %f"
                                   "makeglossaries %b" 
                                   "make BUILD_STRATEGY=pdflatex Chapter05.pdf"))
  (setq org-export-latex-title-command "") 
  (setq org-entities-user '(("space" "\\ " nil " " " " " " " "))) 
  (add-to-list 'org-export-latex-classes '("UoM-draft-org-article"
  "\% -*- \
mode: latex; mode: visual-line; TeX-master: t; TeX-PDF-mode: t \
-*-
\\documentclass[11pt,a4paper,twoside,openright]{book}
  \\usepackage{style/uomthesis} 
  \\input{user-defined}
  \\usepackage[nonumberlist,acronym]{glossaries}
  \\input{../hg/manuscript/misc/glossary} 
  \\makeglossaries
  \\graphicspath{{./gfx/}} 
  \\pretolerance=150 \\tolerance=100
  \\setlength{\\emergencystretch}{3em} 
  \\overfullrule=1mm 
%  \\usepackage[notcite]{showkeys} 
  \\lfoot{\\footnotesize\\today\\ at \\thistime} 
  \\usepackage{rotating,calc}
  \\usepackage{booktabs,ltxtable,lscape} 
\\graphicspath{{../figures/}{/media/data/Work/thesis/GAChapter/gfx/}{/media/data/Work/thesis/GAChapter/archive/gfx/}{/media/data/Work/thesis-gaarticle/newgfx/}{/media/data/Work/thesis-gaarticle/GApaper-submission-JCompNeuro/gfx/}}

  [NO-DEFAULT-PACKAGES]
  [NO-PACKAGES]" 
  ("\\section{%s}" . "\n\\section{%s}")
  ("\\subsection{%s}" . "\n\\subsection{%s}") 
  ("\\subsubsection{%s}" . "\n\\subsubsection{%s}") 
  ("\\paragraph{%s}" . "\n\\paragraph{%s}"))) 
  (setq org-export-latex-title-command
        "{\n\\singlespacing\n\\tableofcontents\n}\n") 
#+end_src

#+RESULTS:
: {
: \singlespacing
: \tableofcontents
: }


